// Даны два числа. Показать большее и меньшее число

int numberA = 45;
int numberB = 19;

if (numberA > numberB)
{
    Console.Write("Большее число ");
    Console.WriteLine(numberA);

    Console.Write("Меньшее число ");
    Console.WriteLine(numberB);
}
else
{
    Console.Write("Большее число ");
    Console.WriteLine(numberB);
    
    Console.Write("Меньшее число ");
    Console.WriteLine(numberA);
}