// Написать программу вычисления значения функции y = f(a) "y=2*a^2+17"

Console.WriteLine("Введите значение x");
int x = int.Parse(Console.ReadLine());
int result = 2*x + 17;
Console.WriteLine(result);

